# Task 2 - Chapter 17 - Big Data

# Task 2-  17.2.1 A books Database

In [1]:
import sqlite3

connection = sqlite3.connect("Data/books.db")

# Task 2-  17.2.2 SELECT Queries

In [2]:
import pandas as pd

pd.options.display.max_columns = 10
pd.read_sql("SELECT * FROM authors", connection, index_col=["id"])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

# Task 2 - 17.2.3 WHERE Clause

In [3]:
pd.read_sql("""SELECT title,edition, copyright FROM titles WHERE copyright > '2017'""",connection)

                           title  edition copyright
0  Intro to Python for CS and DS        1      2020
1            Java How to Program       11      2018

# Task 2 - 17.2.4 ORDER BY Clause

In [4]:
pd.read_sql("""SELECT id, first, last
            FROM authors
            order by first asc""",
            connection, index_col=["id"])

        first    last
id
3       Abbey  Deitel
5   Alexander    Wald
4         Dan   Quirk
2      Harvey  Deitel
1        Paul  Deitel

# Task 2 - 17.2.5 Merging Data from Multiple Tables: INNER JOIN

In [5]:
pd.read_sql("""SELECT first, last,author_ISBN.isbn
            FROM authors 
            INNER JOIN author_ISBN
             ON authors.id = author_ISBN.id
            INNER JOIN titles
              ON titles.isbn = author_ISBN.isbn
            ORDER BY last, first""", 
            connection).head()

    first    last        isbn
0   Abbey  Deitel  0132151006
1   Abbey  Deitel  0133406954
2  Harvey  Deitel  0134289366
3  Harvey  Deitel  0135404673
4  Harvey  Deitel  0132151006

# Task 2 - 17.2.6 INSERT INTO Statement

In [6]:
cursor =connection.cursor()

cursor = cursor.execute("""INSERT INTO authors (first, last) VALUES ("Uma", "Subramanian")""")

In [7]:
pd.read_sql("SELECT * FROM authors", 
            connection, index_col=["id"])

        first         last
id
1        Paul       Deitel
2      Harvey       Deitel
3       Abbey       Deitel
4         Dan        Quirk
5   Alexander         Wald
6         Uma  Subramanian

# Task 2 - 17.2.7 UPDATE Statement

In [8]:
cursor = cursor.execute("""UPDATE authors SET last='Selvan'
                        WHERE first='Uma'""")

In [9]:
pd.read_sql("SELECT * FROM authors", 
            connection, index_col=["id"])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Uma  Selvan

# Task 2 - 17.2.8 DELETE FROM Statement

In [10]:
cursor = cursor.execute("DELETE FROM authors WHERE first ='Uma'")

In [11]:
pd.read_sql("SELECT * FROM authors", 
            connection, index_col=["id"])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald